// Задача 49: Задайте двумерный массив. Найдите элементы, у
// которых оба индекса чётные, и замените эти элементы на их
// квадраты.

int[,] FillArray(int[,] matr)
{
    for (int i = 0; i < matr.GetLength(0); i++)
    {
        for (int j = 0; j < matr.GetLength(1); j++)
        {
            matr[i, j] = new Random().Next(0, 100);
        }
    }
    return matr;

}

void PrintArray(int[,] matr)
{
    for (int i = 0; i < matr.GetLength(0); i++)
    {
        for (int j = 0; j < matr.GetLength(1); j++)
        {
            Console.Write($"{matr[i, j]}\t ");
        }
        Console.WriteLine();
    }
}


Console.Clear();
Console.Write("Введите количество строк массива: ");
int a = int.Parse(Console.ReadLine()!);
Console.Write("Введите количество столбцов массива: ");
int b = int.Parse(Console.ReadLine()!);
int[,] array = new int[a, b];

FillArray(array);
PrintArray(array);